{
  "backend/main.mo": "Main backend actor managing access control, user profiles, photos, and short-link generation and lookup.",
  "backend/migration.mo": "Migration module adding an empty shortLinks map to the stored state during upgrades.",
  "feature_evidence.json": "Defines feature evidence entries linking short‑link sharing and auto‑open functionality to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, describing their purpose and functionality.",
  "frontend/index.css": "Tailwind-based global styles defining warm autumn color variables and dark mode overrides.",
  "frontend/index.html": "Base HTML document setting the root element and loading the main frontend script.",
  "frontend/src/App.tsx": "Main React app handling landing layout, upload permissions, gallery display, and auto-opening photos from short links.",
  "frontend/src/components/auth/InternetIdentityButton.tsx": "Authentication button managing Internet Identity login/logout and clearing cached queries on sign-out.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section with background imagery, headline, and buttons that scroll to upload or gallery sections.",
  "frontend/src/components/landing/HighlightsSection.tsx": "Highlights section showing three feature cards with icons and descriptions.",
  "frontend/src/components/landing/LandingHeader.tsx": "Renders a sticky header with logo, navigation buttons, and an Internet Identity login button, including smooth scrolling to sections.",
  "frontend/src/components/photos/PhotoGallery.tsx": "Displays photos in a responsive grid with loading, error, and empty states, and supports clicking photos to open a viewer.",
  "frontend/src/components/photos/PhotoUploadForm.tsx": "Provides an image upload form with drag‑and‑drop, preview, progress tracking, and success/error handling using the upload hook.",
  "frontend/src/components/photos/PhotoViewerDialog.tsx": "Shows a dialog with a large photo preview, metadata, and an optional admin‑only share‑link generator with copy‑to‑clipboard support.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity authentication, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing identity loading, login, logout, and session state via AuthClient.",
  "frontend/src/hooks/usePhotos.ts": "Provides hooks for listing and uploading photos, including file validation, byte conversion, and React Query caching behavior.",
  "frontend/src/hooks/useShortLinks.ts": "Provides hooks for creating short photo links via backend mutation and resolving them with a query, including base62 short-code generation.",
  "frontend/src/hooks/useUploadAuthorization.ts": "Fetches whether the current actor is allowed to upload and exposes convenient flags for UI state.",
  "frontend/src/index.css": "Defines global Tailwind layers and custom OKLCH color variables for light and dark themes with an autumn palette.",
  "frontend/src/lib/utils.ts": "Exports a cn helper combining clsx and tailwind-merge for conditional class merging.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, importing the global stylesheet.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading and modifying URL hash params and securely retrieving secret query parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing current features, design notes, known issues, and versioned state."
}