{
  "kind": "build_request",
  "title": "Add in-app short share links for photos",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add backend support for short photo links by storing and resolving short codes that map to existing photo IDs.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can I shorten link length"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a method for an authorized admin to create (or retrieve if already created) a short code for a given photo ID.",
        "Backend exposes a public query method that resolves a short code to the corresponding photo ID (or returns null/none if not found).",
        "Short codes are significantly shorter than the original photo ID (e.g., base62 or similar) and are unique across photos.",
        "All visitors (including unauthenticated) can resolve short codes to photo IDs, but only authorized admins can create new short codes.",
        "If the backend uses stable state for persistence, the short-code mapping persists across canister upgrades (add migration logic only if required by existing stable layout)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add a “Copy share link” action to the photo viewer that generates a short URL using the current site origin plus a short-code parameter and copies it to the clipboard, showing a clear success/error message in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can I shorten link length"
        ]
      },
      "acceptanceCriteria": [
        "In the photo viewer dialog, a visible control labeled \"Copy share link\" is available when a photo is open.",
        "Clicking the control requests/obtains a short code for that photo (only if the current user is authorized to do so) and copies a URL formatted like \"<origin>/#s=<shortCode>\" to the clipboard.",
        "After copying, the UI shows an English confirmation message (e.g., \"Link copied to clipboard.\"); if copying fails, show an English error message.",
        "If the user is not authorized to create short links, the UI does not offer the action (or it is disabled with an English explanation), and the rest of the viewer continues to work normally."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Enable opening a photo directly from a short link by detecting the short-code parameter on initial page load and automatically opening the corresponding photo in the existing photo viewer dialog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can I shorten link length"
        ]
      },
      "acceptanceCriteria": [
        "When the app loads with a URL containing \"#s=<shortCode>\", the app resolves the short code and opens the matching photo in the existing PhotoViewerDialog without requiring authentication.",
        "If the short code is invalid or cannot be resolved, show an English, user-friendly message (and do not crash).",
        "After resolving/handling the short-code parameter, normal navigation and gallery browsing continue to work as before."
      ]
    }
  ],
  "constraints": [
    "Do not rely on external URL shortener services or any third-party APIs.",
    "Do not require custom domain configuration or DNS changes to implement this; implement link shortening entirely within the existing canister + frontend.",
    "Preserve existing public gallery browsing behavior and existing owner-only upload restrictions.",
    "Keep all Motoko logic in the single backend/main.mo actor; add migration logic only if needed by existing stable state constraints."
  ],
  "nonGoals": [
    "Setting up a custom domain for the canister (DNS/registrar configuration).",
    "Integrating with commercial link shorteners (Bitly, Rebrandly, etc.).",
    "Adding social sharing integrations (Facebook/Twitter/Instagram APIs)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}