{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "In-app short share links for photos (frontend)",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Add a \"Copy share link\" control in the photo viewer that obtains a short code (admin-only) and copies an \"<origin>/#s=<shortCode>\" URL with clear English success/error messaging.",
      "acceptanceCriteria": [
        "In the photo viewer dialog, a visible control labeled \"Copy share link\" is available when a photo is open.",
        "Clicking the control requests/obtains a short code for that photo (only if the current user is authorized to do so) and copies a URL formatted like \"<origin>/#s=<shortCode>\" to the clipboard.",
        "After copying, the UI shows an English confirmation message (e.g., \"Link copied to clipboard.\"); if copying fails, show an English error message.",
        "If the user is not authorized to create short links, the UI does not offer the action (or it is disabled with an English explanation), and the rest of the viewer continues to work normally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backendInterface typings to include the admin-only backend capability used to create (or retrieve) a short code for a given photo ID, returning the short code as a string. Keep existing public resolution methods typed for unauthenticated use."
        },
        {
          "path": "frontend/src/hooks/useShortLinks.ts",
          "operation": "create",
          "description": "Create React Query hooks for short-link actions: (1) an admin-only mutation to obtain a short code for a photo ID via the backend capability and (2) a query/helper to resolve short codes when needed. Ensure authorization failures are surfaced as user-friendly English errors in the UI."
        },
        {
          "path": "frontend/src/components/photos/PhotoViewerDialog.tsx",
          "operation": "modify",
          "description": "Add a \"Copy share link\" action within the existing PhotoViewerDialog layout. Use the authorization system to determine if the current caller is admin (e.g., via existing backend role checks) and only show/enable the action when authorized. On click, call the short-link hook to obtain the short code, build the URL using window.location.origin + '/#s=' + shortCode, copy via the Clipboard API, and display clear English success/error feedback. Use existing shadcn-ui UI components already used elsewhere (e.g., Button/Alert) for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "On initial load, detect \"#s=<shortCode>\" in the URL, resolve it publicly, and open the corresponding photo in the existing PhotoViewerDialog with friendly English error handling.",
      "acceptanceCriteria": [
        "When the app loads with a URL containing \"#s=<shortCode>\", the app resolves the short code and opens the matching photo in the existing PhotoViewerDialog without requiring authentication.",
        "If the short code is invalid or cannot be resolved, show an English, user-friendly message (and do not crash).",
        "After resolving/handling the short-code parameter, normal navigation and gallery browsing continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Extend URL utilities to correctly read hash-fragment parameters in the \"#key=value\" form (not only \"#/?...\"), specifically supporting \"#s=<shortCode>\". Add a safe utility to clear/remove the processed \"s\" parameter from the hash after handling to preserve normal navigation behavior."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire short-link opening into the app lifecycle: on initial load (and when the actor becomes available), detect \"#s\" from the hash, resolve it using the public backend capability, fetch the matching photo metadata if needed, and set selectedPhoto to open the existing PhotoViewerDialog. If resolution fails, display an English, user-friendly message (using existing UI primitives already present in the app). Ensure the parameter is cleared after handling so normal browsing continues unaffected."
        },
        {
          "path": "frontend/src/hooks/useShortLinks.ts",
          "operation": "modify",
          "description": "Add/adjust a public resolution helper used by App.tsx to resolve a short code to a photo (or photo ID), designed to work with the anonymous actor (no authentication) and to return a clear not-found state for invalid codes."
        }
      ]
    }
  ]
}